Dan Team/Richard/FlightE2ETests/APITestCreateOrder/Log/vtd_user.log

2021-07-27 21:19:07,736 [1] INFO  - Loaded appender: FileAppenderInternal
2021-07-27 21:19:07,765 [1] INFO  - Loaded appender: FileAppenderExternal
2021-07-27 21:19:07,765 [1] INFO  - Loaded appender: UserLoggerAppender
2021-07-27 21:19:07,766 [1] INFO  - Loaded appender: FileAppenderInternal
2021-07-27 21:19:07,766 [1] INFO  - Loaded appender: FileAppenderExternal
2021-07-27 21:19:07,767 [1] INFO  - Loaded appender: UserLoggerAppender
2021-07-27 21:19:08,870 [9] INFO  - Step 'Start' : Step 'Start' started
2021-07-27 21:19:08,974 [9] INFO  - Step 'Start' ended successfully
2021-07-27 21:19:08,983 [9] INFO  - Step 'Test Flow' : Step 'Test Flow' started
2021-07-27 21:19:08,987 [9] INFO  - Step 'Iteration 1' : Step 'Iteration 1' started
2021-07-27 21:19:08,990 [9] INFO  - Step 'GetFlights' : Step 'GetFlights' started
2021-07-27 21:19:09,017 [9] INFO  - 
Request:

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
  <Body>
    <GetFlights xmlns="HP.SOAQ.SampleApp">
      <DepartureCity>Denver</DepartureCity>
      <ArrivalCity>Frankfurt</ArrivalCity>
      <FlightDate>2022-02-22T00:00:00+02:00</FlightDate>
    </GetFlights>
  </Body>
</Envelope>

2021-07-27 21:19:09,258 [9] INFO  - URL: http://localhost:8000/Flights_SOAP
2021-07-27 21:19:09,426 [9] INFO  - Returning the response to the previous channel
2021-07-27 21:19:09,433 [9] INFO  - 
Response:

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <GetFlightsResponse xmlns="HP.SOAQ.SampleApp">
      <GetFlightsResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>08:53 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:09 AM</DepartureTime>
          <FlightNumber>14686</FlightNumber>
          <Price>179.47</Price>
        </Flight>
        <Flight>
          <Airline>AF</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>10:00 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:00 AM</DepartureTime>
          <FlightNumber>15779</FlightNumber>
          <Price>161.9</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>08:45 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:00 AM</DepartureTime>
          <FlightNumber>15781</FlightNumber>
          <Price>105.4</Price>
        </Flight>
        <Flight>
          <Airline>AF</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>11:30 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:00 AM</DepartureTime>
          <FlightNumber>15782</FlightNumber>
          <Price>173.47</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>11:09 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>10:24 AM</DepartureTime>
          <FlightNumber>15785</FlightNumber>
          <Price>104</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>01:33 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>12:48 PM</DepartureTime>
          <FlightNumber>15789</FlightNumber>
          <Price>106</Price>
        </Flight>
        <Flight>
          <Airline>DL</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>04:42 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>03:12 PM</DepartureTime>
          <FlightNumber>15792</FlightNumber>
          <Price>178.47</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>03:57 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>03:12 PM</DepartureTime>
          <FlightNumber>15793</FlightNumber>
          <Price>105.3</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>06:29 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>05:45 PM</DepartureTime>
          <FlightNumber>16102</FlightNumber>
          <Price>110.8</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>01:41 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>12:57 PM</DepartureTime>
          <FlightNumber>16396</FlightNumber>
          <Price>120.4</Price>
        </Flight>
      </GetFlightsResult>
    </GetFlightsResponse>
  </s:Body>
</s:Envelope>

2021-07-27 21:19:09,469 [9] INFO  - Structural Validation: True
2021-07-27 21:19:09,478 [9] INFO  - Step 'GetFlights' ended successfully
2021-07-27 21:19:09,480 [9] INFO  - Step 'CreateFlightOrder' : Step 'CreateFlightOrder' started
2021-07-27 21:19:09,487 [9] INFO  - 
Request:

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:p1="http://www.w3.org/2001/XMLSchema-instance">
  <Body>
    <CreateFlightOrder xmlns="HP.SOAQ.SampleApp">
      <FlightOrder>
        <Class>Business</Class>
        <CustomerName>john</CustomerName>
        <DepartureDate>2022-02-22T00:00:00+02:00</DepartureDate>
        <FlightNumber>14686</FlightNumber>
        <NumberOfTickets>5</NumberOfTickets>
      </FlightOrder>
    </CreateFlightOrder>
  </Body>
</Envelope>

2021-07-27 21:19:09,491 [9] INFO  - URL: http://localhost:8000/Flights_SOAP
2021-07-27 21:19:09,521 [9] INFO  - Returning the response to the previous channel
2021-07-27 21:19:09,522 [9] INFO  - 
Response:

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <CreateFlightOrderResponse xmlns="HP.SOAQ.SampleApp">
      <CreateFlightOrderResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <OrderNumber>833</OrderNumber>
        <TotalPrice>1794.7</TotalPrice>
      </CreateFlightOrderResult>
    </CreateFlightOrderResponse>
  </s:Body>
</s:Envelope>

2021-07-27 21:19:09,528 [9] INFO  - Structural Validation: True
2021-07-27 21:19:09,532 [9] INFO  - Step 'CreateFlightOrder' ended successfully
2021-07-27 21:19:09,535 [9] INFO  - Step 'Iteration 1' ended successfully
2021-07-27 21:19:09,538 [9] INFO  - Step 'Iteration 2' : Step 'Iteration 2' started
2021-07-27 21:19:09,541 [9] INFO  - Step 'GetFlights' : Step 'GetFlights' started
2021-07-27 21:19:09,545 [9] INFO  - 
Request:

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
  <Body>
    <GetFlights xmlns="HP.SOAQ.SampleApp">
      <DepartureCity>Denver</DepartureCity>
      <ArrivalCity>Frankfurt</ArrivalCity>
      <FlightDate>2022-02-22T00:00:00+02:00</FlightDate>
    </GetFlights>
  </Body>
</Envelope>

2021-07-27 21:19:09,548 [9] INFO  - URL: http://localhost:8000/Flights_SOAP
2021-07-27 21:19:09,554 [9] INFO  - Returning the response to the previous channel
2021-07-27 21:19:09,556 [9] INFO  - 
Response:

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <GetFlightsResponse xmlns="HP.SOAQ.SampleApp">
      <GetFlightsResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>08:53 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:09 AM</DepartureTime>
          <FlightNumber>14686</FlightNumber>
          <Price>179.47</Price>
        </Flight>
        <Flight>
          <Airline>AF</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>10:00 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:00 AM</DepartureTime>
          <FlightNumber>15779</FlightNumber>
          <Price>161.9</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>08:45 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:00 AM</DepartureTime>
          <FlightNumber>15781</FlightNumber>
          <Price>105.4</Price>
        </Flight>
        <Flight>
          <Airline>AF</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>11:30 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:00 AM</DepartureTime>
          <FlightNumber>15782</FlightNumber>
          <Price>173.47</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>11:09 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>10:24 AM</DepartureTime>
          <FlightNumber>15785</FlightNumber>
          <Price>104</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>01:33 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>12:48 PM</DepartureTime>
          <FlightNumber>15789</FlightNumber>
          <Price>106</Price>
        </Flight>
        <Flight>
          <Airline>DL</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>04:42 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>03:12 PM</DepartureTime>
          <FlightNumber>15792</FlightNumber>
          <Price>178.47</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>03:57 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>03:12 PM</DepartureTime>
          <FlightNumber>15793</FlightNumber>
          <Price>105.3</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>06:29 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>05:45 PM</DepartureTime>
          <FlightNumber>16102</FlightNumber>
          <Price>110.8</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>01:41 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>12:57 PM</DepartureTime>
          <FlightNumber>16396</FlightNumber>
          <Price>120.4</Price>
        </Flight>
      </GetFlightsResult>
    </GetFlightsResponse>
  </s:Body>
</s:Envelope>

2021-07-27 21:19:09,566 [9] INFO  - Structural Validation: True
2021-07-27 21:19:09,570 [9] INFO  - Step 'GetFlights' ended successfully
2021-07-27 21:19:09,572 [9] INFO  - Step 'CreateFlightOrder' : Step 'CreateFlightOrder' started
2021-07-27 21:19:09,577 [9] INFO  - 
Request:

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:p1="http://www.w3.org/2001/XMLSchema-instance">
  <Body>
    <CreateFlightOrder xmlns="HP.SOAQ.SampleApp">
      <FlightOrder>
        <Class>Business</Class>
        <CustomerName>john</CustomerName>
        <DepartureDate>2022-02-22T00:00:00+02:00</DepartureDate>
        <FlightNumber>14686</FlightNumber>
        <NumberOfTickets>5</NumberOfTickets>
      </FlightOrder>
    </CreateFlightOrder>
  </Body>
</Envelope>

2021-07-27 21:19:09,582 [9] INFO  - URL: http://localhost:8000/Flights_SOAP
2021-07-27 21:19:09,594 [9] INFO  - Returning the response to the previous channel
2021-07-27 21:19:09,597 [9] INFO  - 
Response:

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <CreateFlightOrderResponse xmlns="HP.SOAQ.SampleApp">
      <CreateFlightOrderResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <OrderNumber>834</OrderNumber>
        <TotalPrice>1794.7</TotalPrice>
      </CreateFlightOrderResult>
    </CreateFlightOrderResponse>
  </s:Body>
</s:Envelope>

2021-07-27 21:19:09,606 [9] INFO  - Structural Validation: True
2021-07-27 21:19:09,611 [9] INFO  - Step 'CreateFlightOrder' ended successfully
2021-07-27 21:19:09,615 [9] INFO  - Step 'Iteration 2' ended successfully
2021-07-27 21:19:09,617 [9] INFO  - Step 'Iteration 3' : Step 'Iteration 3' started
2021-07-27 21:19:09,620 [9] INFO  - Step 'GetFlights' : Step 'GetFlights' started
2021-07-27 21:19:09,629 [9] INFO  - 
Request:

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
  <Body>
    <GetFlights xmlns="HP.SOAQ.SampleApp">
      <DepartureCity>Denver</DepartureCity>
      <ArrivalCity>Frankfurt</ArrivalCity>
      <FlightDate>2022-02-22T00:00:00+02:00</FlightDate>
    </GetFlights>
  </Body>
</Envelope>

2021-07-27 21:19:09,633 [9] INFO  - URL: http://localhost:8000/Flights_SOAP
2021-07-27 21:19:09,640 [9] INFO  - Returning the response to the previous channel
2021-07-27 21:19:09,643 [9] INFO  - 
Response:

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <GetFlightsResponse xmlns="HP.SOAQ.SampleApp">
      <GetFlightsResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>08:53 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:09 AM</DepartureTime>
          <FlightNumber>14686</FlightNumber>
          <Price>179.47</Price>
        </Flight>
        <Flight>
          <Airline>AF</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>10:00 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:00 AM</DepartureTime>
          <FlightNumber>15779</FlightNumber>
          <Price>161.9</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>08:45 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:00 AM</DepartureTime>
          <FlightNumber>15781</FlightNumber>
          <Price>105.4</Price>
        </Flight>
        <Flight>
          <Airline>AF</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>11:30 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:00 AM</DepartureTime>
          <FlightNumber>15782</FlightNumber>
          <Price>173.47</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>11:09 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>10:24 AM</DepartureTime>
          <FlightNumber>15785</FlightNumber>
          <Price>104</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>01:33 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>12:48 PM</DepartureTime>
          <FlightNumber>15789</FlightNumber>
          <Price>106</Price>
        </Flight>
        <Flight>
          <Airline>DL</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>04:42 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>03:12 PM</DepartureTime>
          <FlightNumber>15792</FlightNumber>
          <Price>178.47</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>03:57 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>03:12 PM</DepartureTime>
          <FlightNumber>15793</FlightNumber>
          <Price>105.3</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>06:29 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>05:45 PM</DepartureTime>
          <FlightNumber>16102</FlightNumber>
          <Price>110.8</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>01:41 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>12:57 PM</DepartureTime>
          <FlightNumber>16396</FlightNumber>
          <Price>120.4</Price>
        </Flight>
      </GetFlightsResult>
    </GetFlightsResponse>
  </s:Body>
</s:Envelope>

2021-07-27 21:19:09,651 [9] INFO  - Structural Validation: True
2021-07-27 21:19:09,655 [9] INFO  - Step 'GetFlights' ended successfully
2021-07-27 21:19:09,657 [9] INFO  - Step 'CreateFlightOrder' : Step 'CreateFlightOrder' started
2021-07-27 21:19:09,665 [9] INFO  - 
Request:

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:p1="http://www.w3.org/2001/XMLSchema-instance">
  <Body>
    <CreateFlightOrder xmlns="HP.SOAQ.SampleApp">
      <FlightOrder>
        <Class>Business</Class>
        <CustomerName>john</CustomerName>
        <DepartureDate>2022-02-22T00:00:00+02:00</DepartureDate>
        <FlightNumber>14686</FlightNumber>
        <NumberOfTickets>5</NumberOfTickets>
      </FlightOrder>
    </CreateFlightOrder>
  </Body>
</Envelope>

2021-07-27 21:19:09,669 [9] INFO  - URL: http://localhost:8000/Flights_SOAP
2021-07-27 21:19:09,679 [9] INFO  - Returning the response to the previous channel
2021-07-27 21:19:09,682 [9] INFO  - 
Response:

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <CreateFlightOrderResponse xmlns="HP.SOAQ.SampleApp">
      <CreateFlightOrderResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <OrderNumber>835</OrderNumber>
        <TotalPrice>1794.7</TotalPrice>
      </CreateFlightOrderResult>
    </CreateFlightOrderResponse>
  </s:Body>
</s:Envelope>

2021-07-27 21:19:09,690 [9] INFO  - Structural Validation: True
2021-07-27 21:19:09,694 [9] INFO  - Step 'CreateFlightOrder' ended successfully
2021-07-27 21:19:09,697 [9] INFO  - Step 'Iteration 3' ended successfully
2021-07-27 21:19:09,700 [9] INFO  - Step 'Test Flow' ended successfully
2021-07-27 21:19:09,703 [9] INFO  - Step 'End' : Step 'End' started
2021-07-27 21:19:09,718 [9] INFO  - Step 'End' ended successfully
